import os
import gspread
from oauth2client.service_account import ServiceAccountCredentials
from flask import Flask, render_template, request, redirect, url_for
from datetime import datetime

app = Flask(__name__)

# Google Sheets API тохиргоо
scope = [
    "https://spreadsheets.google.com/feeds",
    "https://www.googleapis.com/auth/spreadsheets",
    "https://www.googleapis.com/auth/drive.file",
    "https://www.googleapis.com/auth/drive"
]
creds = ServiceAccountCredentials.from_json_keyfile_name("credentials.json", scope)
client = gspread.authorize(creds)
sheet = client.open("Dump inspection sheet").worksheet("Өдөр.дутмын.үзлэг")

# Асуумжийн жагсаалт
all_questions = {
    'dump': [
        'ХАБ-ын иж бүрдэл', 'Кардан голны бүрэн байдал',
        'Хойд дугуй, урд дугуйнууд, шпилк болон хойд тэнхлэгийг шалгах',
        'Захын дамжуулагч, подвескны гоожилт шалгах',
        'Тэвш, өргөх цилиндрийн пальц, суурь боолт',
        'Тормозны шугамуудыг шалгах',
        'Чулуу зайлуулагч, шаврын хаалтны бүрэн байдал',
        'Шланк, цилиндр, хомутны бэхэлгээ',
        'Нумны бүрэн бүтэн байдал шалгах', 
        'Аккумуляторын бэхэлгээ, клем, толгой',
        'Гидрийн шингэний түвшин', 'Радиаторын гуурс, хоолой',
        'Хөдөлгүүрийн тосны түвшин', 'Трансмиссын шингэний түвшин',
        'Радиаторын антифризийн түвшин', 'Гидрийн бак, шланкны бүрэн байдал',
        'Хөргөлтийн системийн бүрэн байдал', 'Сэнс, жанам, агааржуулагчийн ремен',
        'Рулийн цилиндр болон шланкны гоожилт', 'Хөдөлгүүрийн доод хэсгээр гоожиж байгаа эсэх',
        'Толь, шил арчигч, цонхнуудын бүрэн байдал', 'Суудлын бүс',
        'Бүх хянах самбар, дуут дохио, ухрах дохио, гэрэл',
        'Суурин станц', 'Дугуйн элэгдэл'
    ],
    'excavator': [
        'ХАБ-ын иж бүрдэл', 'Их бие гадаргуу', 'Мотор, одон дугуй, чиглүүлэгч дугуй',
        'Дэмжих ролик', 'Башмак', 'Эргэхийн хүрд', 'Шанага, шүд, хамгаалалт',
        'Шанаганы нурууны босоо цилиндрүүд', 'Тосолгооны шугамууд', 'Цилиндрүүдийн даралтын шланк',
        'Үндсэн болон богино сумны бүрэн байдал', 'Түлш, тосолгооны люк', 'Гишгүүр, тавцан, тавцангийн хаалт', 'Хөдөлгүүрийн тосны түвшин', 'Хөргөлтийн шингэний түвшин', 'Өндөр даралтын шланкууд', 'Турбин болон радиатор', 'Сэнсний болон бусад ремень', 'Насос', 'Цахилгааны утас', 'Галын систем', 'Хянах самбар болон заагчууд', 'Агааржуулагчийн ажиллагаа', 'Шил арчигч', 'Гэрэл, толь, цонхнууд бүрэн эсэх', 'Суудлын бүс', 'Гадна дотор бариул', 'Радио станц', 'Дуут дохио', 'Модулар системийн төхөөрөмж'
    ],
    'dozer': ['ХАБ-ын иж бүрдэл', ''],
    'grader': ['ХАБ-ын иж бүрдэл', 'Их бие гадаргуу', 'Дугуйн даралт болон элэгдэл', 'Нугасан холбоо', 'Хутганы хүрд болон гулгаа', 'Хутганы ир, боолт, хамгаалалт', 'Хутганы босоо болон хэвтээ цилиндр', 'Анжисны /соёо/ цилиндр', 'Анжисны кронк', 'Цилиндрүүдийн даралтын шланк', 'Тосолгооны шугамууд', 'Түлш цэнэглэх хошуу', 'Гишгүүр, тавцан, тавцангийн хаалт', 'Хөдөлгүүрийн тосны түвшин', 'Хөргөлтийн шингэний түвшин', 'Трансмиссийн шингэний түвшин', 'Өндөр даралтын шланкууд', 'Турбин болон радиатор', 'Сэнсний болон бусад ремень', 'Цахилгаан утаснууд', 'Галын систем', 'Хянах самбар болон заагчууд', 'Агааржуулагчийн ажиллагаа', 'Бүх удирдлага, педалиудын ажиллагаа', 'Шил арчигч', 'Толь, Цонхнуудын бүрэн бүтэн эсэх', 'Гадна дотор бариул', 'Суудлын бүс', 'Радио станц', 'Гэрлүүд', 'Дуут дохио', 'Модулар системийн төхөөрөмж'],
    'loader': ['ХАБ-ын иж бүрдэл', 'Шанаганы ир', 'Нугасан холбоо', 'Их бие гадаргуу', 'Түлш цэнэглэх хошуу', 'Тосолгооны шугамууд', 'Шанага, сумны цилиндр', 'Дугуйн даралт болон элэгдэл', 'Цилиндрүүдийн даралтын шланк', 'Гишгүүр, тавцан, тавцангийн хаалт', 'Турбин болон радиатор', 'Галын систем', 'Цахилгааны утаснууд', 'Өндөр даралтын шланкууд', 'Сэнсний болон бусад ремень', 'Хөдөлгүүрийн тосны түвшин', 'Хөргөлтийн шингэний түвшин', 'Трансмиссийн шингэний түвшин', 'Хянах самбар болон заагчууд', 'Шил арчигч', 'Суудлын бүс', 'Гадна дотор бариул', 'Радио станц', 'Дуут дохио', 'Толь, цонхнууд бүрэн бүтэн эсэх', 'Агааржуулагчийн ажиллагаа', 'Анхааруулах болон үйлдлийн гэрлүүд', 'Бүх удирдлага, педалиудын ажиллагаа', 'Модулар системийн төхөөрөмж']
}

# Нүүр хуудас
@app.route("/")
def index():
    return render_template("index.html")

# Формын хуудас
@app.route("/form/<vehicle>")
def form(vehicle):
    questions = all_questions.get(vehicle, [])
    return render_template("form.html", vehicle=vehicle, questions=questions)

# Илгээх route
@app.route("/submit", methods=["POST"])
def submit():
    data = request.form
    #Улаанбаатар хотын цаг
    ub_timezone=pytz.timezone('Asia/Ulaanbaatar')
    timestamp = datetime.now(ub_timezone).strftime("%Y-%m-%d %H:%M")

    row = [
        timestamp,
        data.get("vehicle"),
        data.get("park_number"),
        data.get("Мот цаг"),
        data.get("shift"),
        data.get("operator"),
        data.get("mechanic"),
        data.get("comment")
    ]

    # Асуултуудыг нэмэх
    questions = all_questions.get(data.get("vehicle"), [])
    for i in range(1, len(questions) + 1):
        row.append(data.get(f"q{i}", ""))

    # Sheet рүү бичих
    sheet.append_row(row)

    return redirect(url_for("success"))
    
@app.route('/success')
def success():
    return render_template("success.html")

# Server run
if __name__ == "__main__":
    app.run(debug=True)
